# Q28
# 查询所有学生的课程及分数情况（存在学生没成绩，没选课的情况）
# 典型的外联结
select s.SId,
       s.Sname,
       sc.CId,
       sc.score
from Student as s
         inner join
     SC as sc on s.SId = sc.SId;

# +---+-----+---+-----+
# |SId|Sname|CId|score|
# +---+-----+---+-----+
# |01 |赵雷   |01 |80.0 |
# |01 |赵雷   |02 |90.0 |
# |01 |赵雷   |03 |99.0 |
# |02 |钱电   |01 |70.0 |
# |02 |钱电   |02 |60.0 |
# |02 |钱电   |03 |80.0 |
# |03 |孙风   |01 |80.0 |
# |03 |孙风   |02 |80.0 |
# |03 |孙风   |03 |80.0 |
# |04 |李云   |01 |50.0 |
# |04 |李云   |02 |30.0 |
# |04 |李云   |03 |20.0 |
# |05 |周梅   |01 |76.0 |
# |05 |周梅   |02 |87.0 |
# |06 |吴兰   |01 |31.0 |
# |06 |吴兰   |03 |34.0 |
# |07 |郑竹   |02 |89.0 |
# |07 |郑竹   |03 |98.0 |
# +---+-----+---+-----+

