# Q10
# 查询没学过 张三 老师讲授的任一门课程的学生姓名
# 其实就是学过张三老师的学生的取反
# 三层子嵌套或者多表联合查询，都可以。这里给出多表联合查询
select s.*
from Student as s
where s.SId not in
      (
          # 查询上过张三老师（数学课）的学生名单
          select sc.SId
          from SC as sc,
               Course as c,
               Teacher as t
          where sc.CId = c.CId
            and c.TId = t.TId
            and t.Tname = '张三'
      );

# +---+-----+-------------------+----+
# |SId|Sname|Sage               |Ssex|
# +---+-----+-------------------+----+
# |06 |吴兰   |1992-01-01 00:00:00|女   |
# |09 |张三   |2017-12-20 00:00:00|女   |
# |10 |李四   |2017-12-25 00:00:00|女   |
# |11 |李四   |2012-06-06 00:00:00|女   |
# |12 |赵六   |2013-06-13 00:00:00|女   |
# |13 |孙七   |2014-06-01 00:00:00|女   |
# +---+-----+-------------------+----+

