# Q14
# 查询各科成绩最高分、最低分和平均分，显示为：课程 ID，课程 name，最高分，最低分，平均分，及格率，中等率，优良率，优秀率
# >=60及格，70-79中等，80-89良好，>=90优秀
# 要求输出课程号和选修人数（查询结果按人数降序排列，若人数相同，按课程号升序排列）
# 使用if/case表达式配合聚合函数来解析
# 小心group by和order by的生效顺序
select sc.CId,
       max(sc.score)                                              as 最高分,
       min(sc.score)                                              as 最低分,
       AVG(sc.score)                                              as 平均分,
       count(*)                                                   as 选修人数,
       sum(IF(sc.score >= 60, 1, 0)) / count(*)                   as 及格率,
       sum(IF(sc.score >= 70 and sc.score < 80, 1, 0)) / count(*) as 中等率,
       sum(IF(sc.score >= 80 and sc.score < 90, 1, 0)) / count(*) as 优良率,
       sum(IF(sc.score >= 90, 1, 0)) / count(*)                   as 优秀率
from SC sc
GROUP BY sc.CId
ORDER BY count(*) DESC, sc.CId;

# +---+----+----+--------+----+------+------+------+------+
# |CId|最高分 |最低分 |平均分     |选修人数|及格率   |中等率   |优良率   |优秀率   |
# +---+----+----+--------+----+------+------+------+------+
# |01 |80.0|31.0|64.50000|6   |0.6667|0.3333|0.3333|0.0000|
# |02 |90.0|30.0|72.66667|6   |0.8333|0.0000|0.5000|0.1667|
# |03 |99.0|20.0|68.50000|6   |0.6667|0.0000|0.3333|0.3333|
# +---+----+----+--------+----+------+------+------+------+

