# Q15.1
# 按各科成绩对学生进行排序，并显示排名，Score重复时合并名次
# 所谓名次合并，意思是两个人的成绩一致按照一个名次来，会出现两个“第n名”，之后的学生则是“第n+2名”
# 和q15的区别在于score_grade的对象是谁
select sc1.CId,
       sc1.SId,
       sc1.score,
       count(sc2.score) + 1 as score_grade
from SC as sc1
         left join
     SC as sc2
     on sc1.CId = sc2.CId # 同科
         and sc1.score < sc2.score
group by sc1.CId,
         sc1.SId,
         sc1.score
order by sc1.CId,
         score_grade;

# +---+---+-----+-----------+
# |CId|SId|score|score_grade|
# +---+---+-----+-----------+
# |01 |01 |80.0 |1          |
# |01 |03 |80.0 |1          |
# |01 |05 |76.0 |3          |
# |01 |02 |70.0 |4          |
# |01 |04 |50.0 |5          |
# |01 |06 |31.0 |6          |
# |02 |01 |90.0 |1          |
# |02 |07 |89.0 |2          |
# |02 |05 |87.0 |3          |
# |02 |03 |80.0 |4          |
# |02 |02 |60.0 |5          |
# |02 |04 |30.0 |6          |
# |03 |01 |99.0 |1          |
# |03 |07 |98.0 |2          |
# |03 |03 |80.0 |3          |
# |03 |02 |80.0 |3          |
# |03 |06 |34.0 |5          |
# |03 |04 |20.0 |6          |
# +---+---+-----+-----------+

