# Q3
# 查询在SC表存在成绩的学生信息
# 以下分别是子查询和联结，虽然子查询看上去比较简单，但是大部分其实DBMS对联结有查询优化
select *
from Student as s
where s.SId in (select distinct SId from SC);
# 或
select DISTINCT s.*
from Student s,
     SC sc
where s.SId = sc.SId;

# +---+-----+-------------------+----+
# |SId|Sname|Sage               |Ssex|
# +---+-----+-------------------+----+
# |01 |赵雷   |1990-01-01 00:00:00|男   |
# |02 |钱电   |1990-12-21 00:00:00|男   |
# |03 |孙风   |1990-12-20 00:00:00|男   |
# |04 |李云   |1990-12-06 00:00:00|男   |
# |05 |周梅   |1991-12-01 00:00:00|女   |
# |06 |吴兰   |1992-01-01 00:00:00|女   |
# |07 |郑竹   |1989-01-01 00:00:00|女   |
# +---+-----+-------------------+----+

