# Q6
# 查询学过“张三”老师授课的同学的信息
# 多表联合查询。多表慎用，因为数据规模会迅速变大，不少DBMS都有表数限制
select s.*
from Student as s,
     Teacher as t,
     Course as c,
     SC as sc
where s.sid = sc.sid
  and c.cid = sc.cid
  and c.tid = t.tid
  and tname = '张三';

# +---+-----+-------------------+----+
# |SId|Sname|Sage               |Ssex|
# +---+-----+-------------------+----+
# |01 |赵雷   |1990-01-01 00:00:00|男   |
# |02 |钱电   |1990-12-21 00:00:00|男   |
# |03 |孙风   |1990-12-20 00:00:00|男   |
# |04 |李云   |1990-12-06 00:00:00|男   |
# |05 |周梅   |1991-12-01 00:00:00|女   |
# |07 |郑竹   |1989-01-01 00:00:00|女   |
# +---+-----+-------------------+----+

